tutorials/gasifier/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       20500;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       20540;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          260;
        startFace       20580;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       20840;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10400;
        startFace       20840;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10400;
        startFace       31240;
    }
)

// ************************************************************************* //
