tutorials/gasifier/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0      0         0   ) //0
    (0.043 -0.00075   0   ) //1
    (0.043  0.00075   0   ) //2
    (0       0        0.26) //3
    (0.043  -0.00075  0.26) //4
    (0.043   0.00075  0.26) //5
);

blocks
(
    hex (0 1 2 0 3 4 5 3) (40 1 260) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 2 1 0)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (3 4 5 3)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
